In [70]:
import pandas as pd
import numpy as np
import datetime as dt
from datetime import datetime
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
cust=pd.read_excel("Integrated Case Study using Python-Bootcamp.xlsx",sheet_name="Customer Data")
orders=pd.read_excel("Integrated Case Study using Python-Bootcamp.xlsx",sheet_name="Orders Data")

In [3]:
cust.head()

,CUSTOMER_KEY,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
0,C100000,9693593216,N,M,Chennai,APP
1,C100001,9770151476,Y,M,Bangalore,WEBSITE
2,C100002,9779085726,N,M,Gurgaon,WEBSITE
3,C100003,9298611643,N,M,Gurgaon,APP
4,C100004,9929250328,Y,M,Chennai,APP

In [4]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29620 entries, 0 to 29619
Data columns (total 6 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   CUSTOMER_KEY              29620 non-null  object
 1   CONTACT_NUMBER            29620 non-null  int64
 2   Referred Other customers  29620 non-null  object
 3   Gender                    29620 non-null  object
 4   Location                  29620 non-null  object
 5   Acquired Channel          29620 non-null  object
dtypes: int64(1), object(5)
memory usage: 1.4+ MB

In [5]:
cust.isnull().sum()

CUSTOMER_KEY                0
CONTACT_NUMBER              0
Referred Other customers    0
Gender                      0
Location                    0
Acquired Channel            0
dtype: int64

In [6]:
orders

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS
0,O100000,C100000,85.00,0.0,2016-05-18,Delivered,ON-TIME
1,O100001,C100001,307.52,0.0,2016-05-18,Delivered,ON-TIME
2,O100002,C100002,0.00,0.0,2016-05-18,Delivered,ON-TIME
3,O100003,C100003,153.73,0.0,2016-05-18,Delivered,ON-TIME
4,O100004,C100004,-39.55,0.0,2016-05-18,Delivered,ON-TIME
...,...,...,...,...,...,...,...
29611,O129611,C14309,776.40,400.0,2016-07-19,Delivered,ON-TIME
29612,O129612,C12892,1071.50,0.0,2016-07-19,Delivered,ON-TIME
29613,O129613,C10207,137.28,0.0,2016-07-19,Delivered,ON-TIME
29614,O129614,C10222,16.70,0.0,2016-07-19,Delivered,ON-TIME
29615,O129615,C14004,876.64,0.0,2016-07-19,Delivered,ON-TIME

In [7]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29616 entries, 0 to 29615
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ORDER_NUMBER     29616 non-null  object
 1   CUSTOMER_KEY     29616 non-null  object
 2   ORDER_TOTAL      29465 non-null  float64
 3   DISCOUNT         29275 non-null  float64
 4   ORDER_DATE       29616 non-null  datetime64[ns]
 5   ORDER_STATUS     29616 non-null  object
 6   DELIVERY_STATUS  29452 non-null  object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 1.6+ MB

In [8]:
orders.isnull().sum()

ORDER_NUMBER         0
CUSTOMER_KEY         0
ORDER_TOTAL        151
DISCOUNT           341
ORDER_DATE           0
ORDER_STATUS         0
DELIVERY_STATUS    164
dtype: int64

In [9]:
orders.DELIVERY_STATUS.value_counts()

DELIVERY_STATUS
ON-TIME    27814
LATE        1638
Name: count, dtype: int64

In [10]:
orders["ORDER_TOTAL"]=np.where(orders.ORDER_TOTAL.isnull(),orders.ORDER_TOTAL.mean(),orders.ORDER_TOTAL)
orders["DISCOUNT"]=np.where(orders.DISCOUNT.isnull(),orders.DISCOUNT.mean(),orders.DISCOUNT)
orders["DELIVERY_STATUS"]=np.where(orders.DELIVERY_STATUS.isnull(),orders.DELIVERY_STATUS.mode(),orders.DELIVERY_STATUS)

In [11]:
orders.isnull().sum()

ORDER_NUMBER       0
CUSTOMER_KEY       0
ORDER_TOTAL        0
DISCOUNT           0
ORDER_DATE         0
ORDER_STATUS       0
DELIVERY_STATUS    0
dtype: int64

### Q1. Total Revenue (order value)

In [12]:
orders["Total_Revenue"]=(orders.ORDER_TOTAL-orders.DISCOUNT)
print("Total Revenue :",orders["Total_Revenue"].sum())

Total Revenue : 22319821.315223627

### Q2. Total Revenue (order value) by top 25 Customers

In [13]:
orders.groupby("CUSTOMER_KEY")["Total_Revenue"].sum().sort_values(ascending=False).head(25)

CUSTOMER_KEY
C11039      68780.510000
C100213     65667.860000
C13887      55252.870000
C10373      52764.619205
C15598      51637.500000
C10252      48204.600000
C100915     48018.890000
C15021      47904.130000
C10416      46030.940000
C11644      45897.890000
C10207      45631.920000
C1001270    43069.810000
C100113     38683.201313
C15337      38331.700000
C10714      37507.520000
C10778      34729.410000
C10879      34496.060000
C10176      32703.229074
C11620      32657.290000
C10048      31016.410644
C11758      30954.500000
C10115      30785.770000
C100725     30210.780203
C11377      28984.360000
C10078      28894.390000
Name: Total_Revenue, dtype: float64

### Q3. Total number of orders

In [14]:
orders.ORDER_NUMBER.count()

29616

### Q4. Total orders by top 10 customers

In [15]:
orders.groupby("CUSTOMER_KEY")["ORDER_NUMBER"].count().sort_values(ascending=False).head(10)

CUSTOMER_KEY
C10373     63
C10115     40
C10041     34
C10465     33
C10348     32
C10146     31
C10201     30
C10067     29
C100755    27
C11039     26
Name: ORDER_NUMBER, dtype: int64

### Q6. Number of customers ordered once

In [16]:
customers=orders.groupby("CUSTOMER_KEY")["ORDER_NUMBER"].count()
print(" Number of customers ordered once :",customers[customers.values==1].count())

 Number of customers ordered once : 5491

### Q7. Number of customers ordered multiple times

In [17]:
customers=orders.groupby("CUSTOMER_KEY")["ORDER_NUMBER"].count()
print(" Number of customers ordered once :",customers[customers.values>1].count())

 Number of customers ordered once : 5645

### Q8. Number of customers reffered to other customers

In [18]:
customers=cust.CUSTOMER_KEY[cust["Referred Other customers"]=="Y"].count()
print(" Number of customers reffered to other customers",customers)

 Number of customers reffered to other customers 66

### Q9. Which Month have maximum Revenue?

In [19]:
orders.groupby(orders.ORDER_DATE.dt.month_name())["Total_Revenue"].sum().sort_values(ascending=False).head(1)

ORDER_DATE
June    5.708735e+06
Name: Total_Revenue, dtype: float64

### Q10. Number of customers are inactive (that haven't ordered in the last 60 days)

In [20]:
date=orders.ORDER_DATE.max()-dt.timedelta(days=60) #finding time period before 60 days
inactive_customers=orders.CUSTOMER_KEY[orders['ORDER_DATE']<date].nunique() # finding unique values
print("inactive_customers :",inactive_customers)

inactive_customers : 6533

### Q11. Growth Rate  (%) in Orders (from Nov’15 to July’16)

In [21]:
date=orders[(orders["ORDER_DATE"] >= "2015-11-01") & (orders["ORDER_DATE"] <= "2016-07-31")] #filtering
monthly_orders=date.groupby(date["ORDER_DATE"].dt.month_name())["ORDER_TOTAL"].sum().sort_values() #summarising
growth=monthly_orders.pct_change()*100 #converting int percentage
print(growth)

ORDER_DATE
November          NaN
December    72.476221
January     25.920695
February    58.516348
March        6.082353
April       34.777729
May         23.191250
July         9.320153
June        54.644467
Name: ORDER_TOTAL, dtype: float64

### Q12. Growth Rate (%) in Revenue (from Nov'15 to July'16)

In [22]:
date=orders[(orders["ORDER_DATE"] >= "2015-11-01") & (orders["ORDER_DATE"] <= "2016-07-31")] #filtering
monthly_orders=date.groupby(date["ORDER_DATE"].dt.month_name())["Total_Revenue"].sum().sort_values() #summarising
growth=monthly_orders.pct_change()*100 #converting into percentage
print(growth)

ORDER_DATE
November          NaN
December    72.476221
January     25.920695
February    58.467578
March        6.063606
April       34.830562
May         22.859614
July         7.038783
June        56.263035
Name: Total_Revenue, dtype: float64

In [23]:
cust

,CUSTOMER_KEY,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
0,C100000,9693593216,N,M,Chennai,APP
1,C100001,9770151476,Y,M,Bangalore,WEBSITE
2,C100002,9779085726,N,M,Gurgaon,WEBSITE
3,C100003,9298611643,N,M,Gurgaon,APP
4,C100004,9929250328,Y,M,Chennai,APP
...,...,...,...,...,...,...
29615,C14004,9872549883,N,M,Gurgaon,WEBSITE
29616,C100005,9912345421,N,F,Chennai,APP
29617,C100141,9712348986,N,F,Bangalore,WEBSITE
29618,C1001648,9631532242,N,M,Chennai,WEBSITE
29619,C1001350,9585233220,N,F,Chennai,WEBSITE

### Q13. What is the percentage of Male customers exists?

In [24]:
gender=cust.groupby("Gender")["CUSTOMER_KEY"].count() #summarising
per=gender/gender.sum()
per

Gender
F    0.303376
M    0.696624
Name: CUSTOMER_KEY, dtype: float64

### Q14. Which location have maximum customers?

In [25]:
loc=cust.groupby("Location")["CUSTOMER_KEY"].count() #summarising
loc.sort_values(ascending=False).head(1) #max-customers

Location
Gurgaon    11817
Name: CUSTOMER_KEY, dtype: int64

### Q15. How many orders are returned? (Returns can be found if the order total value is negative value)

In [26]:
returned_order=orders[orders.ORDER_TOTAL<0] #filtering negative values
print(returned_order.CUSTOMER_KEY.count(),"orders are returned") #counting negative orders

77 orders are returned

### Q16. Which Acquisition channel is more efficient in terms of customer acquisition?

In [27]:
cust.groupby("Acquired Channel")["CUSTOMER_KEY"].count().sort_values(ascending=False)
#Website is more efficient in terms of customer acquisition

Acquired Channel
WEBSITE    17818
APP        11802
Name: CUSTOMER_KEY, dtype: int64

In [28]:
### Merging both the tables
merged=pd.merge(cust,orders,on="CUSTOMER_KEY",how='inner')
merged

,CUSTOMER_KEY,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel,ORDER_NUMBER,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,Total_Revenue
0,C100000,9693593216,N,M,Chennai,APP,O100000,85.00,0.0,2016-05-18,Delivered,ON-TIME,85.00
1,C100000,9693593216,N,M,Chennai,APP,O100010,335.15,0.0,2016-05-19,Delivered,ON-TIME,335.15
2,C100000,9693593216,N,M,Chennai,APP,O100017,224.73,0.0,2016-05-20,Delivered,ON-TIME,224.73
3,C100000,9693593216,N,M,Chennai,APP,O100025,0.00,0.0,2016-05-20,Delivered,ON-TIME,0.00
4,C100000,9693593216,N,M,Chennai,APP,O106017,127.62,0.0,2016-07-15,Delivered,ON-TIME,127.62
...,...,...,...,...,...,...,...,...,...,...,...,...,...
173643,C19486,9623798327,N,M,Gurgaon,WEBSITE,O129592,751.38,0.0,2016-07-18,Delivered,ON-TIME,751.38
173644,C19487,9703385893,N,M,Others,WEBSITE,O129593,104.11,0.0,2016-07-18,Delivered,ON-TIME,104.11
173645,C19488,9200667897,N,F,Chennai,WEBSITE,O129596,2310.99,200.0,2016-07-18,Delivered,ON-TIME,2110.99
173646,C19489,9485447390,N,M,Bangalore,WEBSITE,O129601,91.77,0.0,2016-07-19,Delivered,ON-TIME,91.77
173647,C19490,9306904398,N,M,Bangalore,WEBSITE,O129605,542.72,0.0,2016-07-19,Delivered,ON-TIME,542.72

### Q17. Which location having more orders with discount amount?

In [29]:
discounted_orders = merged[merged["DISCOUNT"] > 0]
discounted_orders.groupby("Location")["CUSTOMER_KEY"].count()

Location
Bangalore     982
Chennai      1877
Gurgaon      2012
Others        222
Name: CUSTOMER_KEY, dtype: int64

In [30]:
merged["DELIVERY_STATUS"].value_counts()

DELIVERY_STATUS
ON-TIME    164184
LATE         9464
Name: count, dtype: int64

### Q18. Which location having maximum orders delivered in delay

In [31]:
loc=merged[merged["DELIVERY_STATUS"]=="LATE"] #delayed orders
loc.groupby("Location")["CUSTOMER_KEY"].count().sort_values(ascending=False).head(1) #summarising

Location
Gurgaon    3777
Name: CUSTOMER_KEY, dtype: int64

### Q19. What is the percentage of customers who are males acquired by APP channel?

In [32]:
filter_data=merged[merged["Acquired Channel"]=="APP"] #filtering
gender_filter_data=filter_data.groupby("Gender")["CUSTOMER_KEY"].count() #summarising
gender_filter_data/gender_filter_data.sum() #percentage of customers

Gender
F    0.29644
M    0.70356
Name: CUSTOMER_KEY, dtype: float64

### Q20. What is the percentage of orders got canceled?

In [36]:
total_orders=merged.ORDER_TOTAL.count() #total orders
canceled_order=merged.CUSTOMER_KEY[merged['ORDER_STATUS']=="Cancelled"] #canceled_order
percentage=canceled_order.count()/total_orders #percenatge
percentage=round(percentage,4)
print(percentage,"% of orders got canceled")

0.0064 % of orders got canceled

### Q21. What is the percentage of orders done by happy customers (Note: Happy customers mean customer who referred other customers)?

In [71]:
total_orders=merged.CUSTOMER_KEY.count()
happy_cust=merged.CUSTOMER_KEY[merged["Referred Other customers"]=="Y"].count()
perc=(happy_cust/total_orders)*100
perc=round(perc,5)
print(perc,"% of orders done by happy customers ")

0.49871 % of orders done by happy customers

### Q22. Which Location having maximum customers through reference?

In [40]:
data=merged[merged["Referred Other customers"]=="Y"]
data.groupby("Location")['CUSTOMER_KEY'].count().sort_values(ascending=False).head(1)

Location
Gurgaon    390
Name: CUSTOMER_KEY, dtype: int64

### Q23. What is order_total value of male customers who are belongs to Chennai and Happy customers (Happy customer definition is same in question 21)?

In [48]:
data=merged[(merged.Gender=="M")&(merged.Location=="Chennai")&(merged["Referred Other customers"]=="Y")] #Filtering the data
round(data.ORDER_TOTAL.sum(),2) #suming the order value and rounding off

521391.0

### Q24. Which month having maximum order value from male customers belongs to Chennai?

In [58]:
data=merged[(merged.Gender=="M")&(merged.Location=="Chennai")]
monthly_data=data.groupby(data.ORDER_DATE.dt.month_name())["ORDER_NUMBER"].count()
monthly_data.sort_values(ascending=False).head(1)

ORDER_DATE
June    9487
Name: ORDER_NUMBER, dtype: int64

### Q25. What are number of discounted orders ordered by female customers who were acquired by website from Bangalore and delivered orders  on time?

In [69]:
filtered_data=merged[(merged.Gender=="F")&(merged["Acquired Channel"]=="WEBSITE")&(merged.Location=="Bangalore")&(merged.DELIVERY_STATUS=="ON-TIME")&(merged.DISCOUNT>0)]
#filtering data on all the above conditions
print("number of discounted orders ordered by female customers who were acquired by website from Bangalore and delivered orders on time",filtered_data.shape[0])

number of discounted orders ordered by female customers who were acquired by website from Bangalore and delivered orders on time 182